{
  "items": [
    { "key": "sign_up", "value": "Sign Up" },
    { "key": "log_in", "value": "Log In" },
    { "key": "login_title", "value": "Login" },
    { "key": "login_button", "value": "Login" },
    { "key": "register_title", "value": "Register" },
    { "key": "name_label", "value": "Name:" },
    { "key": "email_label", "value": "Email:" },
    { "key": "password_label", "value": "Password:" },
    { "key": "date_label", "value": "Date:" },
    { "key": "month_label", "value": "Month:" },
    { "key": "year_label", "value": "Year:" },
    { "key": "country_label", "value": "Country:" },
    { "key": "gender_label", "value": "Gender:" },
    { "key": "register_button", "value": "Register" },
    { "key": "name_placeholder", "value": "Name..." },
    { "key": "email_placeholder", "value": "Email..." },
    { "key": "password_placeholder", "value": "Password..." },
    { "key": "gender_female", "value": "Female" },
    { "key": "gender_male", "value": "Male" },
    { "key": "gender_non_binary", "value": "Non-binary" },
    { "key": "gender_prefer_not_say", "value": "Prefer not to say" },
    { "key": "error_empty_fields", "value": "Some fields are empty." },
    { "key": "error_invalid_email", "value": "Invalid email format." },
    { "key": "error_invalid_date", "value": "Invalid date selected." },
    { "key": "register_success", "value": "Successful registration, changing to login." },
    { "key": "error_server_unreachable", "value": "Server is unreachable or check your internet connection." },
    { "key": "error_register_failed", "value": "Error registering:" },
    {"key": "login_success","value": "Login successful. Loading main menu..."},
    {"key": "login_failed","value": "Failed to log in."},
    {"key": "field_password","value": "Password"},
    {"key": "field_email","value": "Email"},
    {"key": "field_name","value": "Name"},
    { "key": "select_level", "value": "Select a level" },
    {"key": "boton_resume", "value": "RESUME"},
    {"key": "boton_restart", "value": "RESTART"},
    {"key": "boton_menu", "value": "MENU"},
    { "key": "ui_play_again", "value": "PLAY AGAIN?" },
    { "key": "ui_sound", "value": "Sound" },
    { "key": "ui_brightness", "value": "Brightness" },
    { "key": "ui_life", "value": "        Life" },
    { "key": "ui_upgrade", "value": "       Upgrade" },
    { "key": "missing_checkpoints", "value": "You are missing {0} checkpoint(s)." },

    { "key": "about_cryptochicks_title", "value": "About CryptoChicks" },
    { "key": "about_cryptochicks_description", "value": "CryptoChicks started from \n two software engineers \n and friends, Elena and Natalia,\n walking through the mazes \n of blockchain technology \n and deciding to help other \n women to navigate them.\n Now it is an international \n non-profit with members, events \n and chapters in 56 countries, \n helping thousands \n of women around the globe \n to learn and invest \n in blockchain, build \n new careers and businesses."},

    { "key": "welcome_to", "value": "WELCOME TO" },
    { "key": "cutscene0_line1", "value": "Eve: Order #77-89 for Zarek." },
    { "key": "cutscene0_line2", "value": "Zarek: Always on time, Eve. Central Core has you well trained." },
    { "key": "cutscene0_line3", "value": "Eve: It's part of the protocol. Deliver, scan, follow." },
    { "key": "cutscene0_line4", "value": "Zarek: And you never get tired of it?" },
    { "key": "cutscene0_line5", "value": "Eve: Tired? They only pay me not to think." },
    { "key": "cutscene0_line6", "value": "Zarek: Well, maybe it's time to think about it. If you ever get sick of being just another cog in Central Core... meet me in Sector 3, abandoned warehouse 17. Tonight." },
    { "key": "cutscene0_line7", "value": "Zarek: There's something you should know. Something that could change everything." },
    { "key": "cutscene1_line1", "value": "Zarek: You got to the end! Nice job." },
    { "key": "cutscene1_line2", "value": "Eve: Zarek! What have I done?" },
    { "key": "cutscene1_line3", "value": "Eve: Central Core must have known what we are up to and manipulated the system to get rid of you Zarek... They erased you." },
    { "key": "cutscene1_line4", "value": "Zarek: I will help you as a ghost... Save me... Save the system." },
    { "key": "cutscene1_line5", "value": "Eve: They tricked me... I helped erase you without knowing." },
    { "key": "cutscene2_line1", "value": "Eve: I understand now. Central Core ain't saving data, they're saving identities." },
    { "key": "cutscene2_line2", "value": "Eve: Everything we are is on the network." },
    { "key": "cutscene2_line3", "value": "Eve: Central Core, I'll get to your headquarters." },
    { "key": "cutscene2_line4", "value": "Eve: The headquarters where you save every failure, every fear... Everything..." },
    { "key": "cutscene3_line1", "value": "Eve: I've learned a lot, not just about Blockchain but Security too." },
    { "key": "cutscene3_line2", "value": "Eve: With this knowledge I'm getting stronger." },
    { "key": "cutscene3_line3", "value": "Eve: I will save our world!" },
    { "key": "cutscene4_line1", "value": "Eve: So that's how Cryptocurrency works! . . . Wow." },
    { "key": "cutscene4_line2", "value": "Eve: These drones are getting annoying but at least I’m learning new stuff." },
    { "key": "cutscene4_line3", "value": "Eve: It seems like the one behind all this trouble is a robot called OneCore." },
    { "key": "cutscene5_line1", "value": "Eve: Finally here, let's finish this and save NeonCity." },
    { "key": "cutscene5_line2", "value": "Eve: Show yourself OneCore!" },
    { "key": "cutscene5_line3", "value": "OneCore: MUAHAHAHA THIS IS THE END. PREPARE TO LOSE." },
    { "key": "cutscene6_line1", "value": "Eve: We finally did it. NeonCity is free!" },
    { "key": "cutscene6_line2", "value": "Eve: Central Core can no longer take control." },
    { "key": "cutscene6_line3", "value": "Zarek: Good job, we can finally live decentralized. Let's show everyone how to use the blockchain! Let's free NeonCity!" },

    { "key": "credits_intro", "value": "This app was developed by Tec de Monterrey students for CryptoChicks\n\n\n\n\n" },
    { "key": "credits_title", "value": "\n\n\n\nDevelopers" },
    { "key": "credits_footer", "value": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis app was developed by Tec de Monterrey students for CryptoChicks" },
    
    {"key": "press_E", "value": "Press E"},
    { "key": "incorrect_with_life", "value": "Incorrect!\n-1 life\nCorrect answer:\n" },
    { "key": "incorrect_no_life", "value": "Incorrect!\nCorrect answer:\n" },
    { "key": "correct_reward", "value": "Correct! +100 coins" },


    { "key": "level0_mentor1_line1", "value": "Zarek: Hi! I'm Zarek, thank you for meeting me here. I want to talk to you about something... I used to work for Central Core until I found out what they do with our information. \n\n (Press E to continue)" },
    { "key": "level0_mentor1_line2", "value": "Zarek: Central Core controls all the data in NeonCity. What you see, buy and know... Everything is on their servers. If something isn't convenient for them, they modify it. If someone challenges them, they erase their identity. In other words, they modify and erase information in their favor." },
    { "key": "level0_mentor1_line3", "value": "Zarek: And that's exactly why the centralization of information is so dangerous for us, but... there is a solution... Blockchain." },
    { "key": "level0_mentor1_line4", "value": "Blockchain is a system where the information is not saved in only one place. Instead, it is copied in thousands of computers at the same time. If someone changes something, they would have to modify ALL the copies at the same time, which is impossible." },
    { "key": "level0_mentor1_line5", "value": "Zarek: So now you see, Eve… the problem isn’t just the system. It’s who controls it, but things are changing. Out there, in the shadows of NeonCity, there's a new movement rising. People who believe in transparency, in truth that cannot be rewritten." },
    { "key": "level0_mentor1_line6", "value": "Zarek: We're building something better… something free. And I want you to be part of it. But before you join us, you need to prove that you understand what we’re fighting for." },
    { "key": "level0_mentor1_line7", "value": "Zarek: This isn’t just tech—it’s a revolution. And only those who grasp its core can wield it." },
    { "key": "level0_mentor2_line1", "value": "Zarek: Beware of the drones! They belong to Central Core and if they touch you they will rest you one life." },
    { "key": "level0_mentor2_line2", "value": "Zarek: You can shoot them by pressing the spacebar and you will get 100 points." },
    { "key": "level0_mentor2_line3", "value": "Zarek: Collect all the coins you can, you can use them to buy lives." },
    { "key": "level0_mentor2_line4", "value": "Zarek: One more thing... all the antennas represent questions about blockchain. You have to answer them all to prove your knowledge and to complete the level. Otherwise, you will not be able to change level." },
    { "key": "level0_mentor2_line5", "value": "Zarek: If you answer well, you will be rewarded with 100 coins, otherwise you will lose a life." },
    { "key": "level0_mentor2_line6", "value": "Zarek: But don't worry! I will explain you the concepts before answering the questions." },
    { "key": "level0_mentor2_line7", "value": "Zarek: When you reach the alien you will be able to continue to the next level." },
    { "key": "level0_mentor2_line8", "value": "Zarek: Good Luck!" },
    { "key": "level0_mentor3_line1", "value": "Zarek: Amazing! You are getting all the content right away!" },
    { "key": "level0_mentor3_line2", "value": "Zarek: Now that you know what Blockchain is, you need to understand how decentralized verification works." },
    { "key": "level0_mentor3_line3", "value": "Zarek: When someone sends data in the blockchain—like a message or a transaction—it doesn't just go through. First, it's checked by multiple people in the network." },
    { "key": "level0_mentor3_line4", "value": "Zarek: These people, or rather, nodes, all have a copy of the blockchain. They compare the new data with what they already have to confirm it's valid. That way, no one can sneak in false information." },
    { "key": "level0_mentor4_line1", "value": "Zarek: You are doing great! So... now let's continue. Let's talk about how we can use blocks as containers of information." },
    { "key": "level0_mentor4_line2", "value": "Zarek: Once the information is verified, it doesn’t just float around. It's grouped into a structure we call a block." },
    { "key": "level0_mentor4_line3", "value": "Zarek: Each block contains several verified transactions and a unique code that links it to the previous block. That connection forms a chain that cannot be broken or altered. It’s like a digital timeline that no one can rewrite." },
    { "key": "level0_mentor5_line1", "value": "Zarek: Follow me, you still have a lot to learn about Blockchain!" },

    { "key": "level1_mentor1_line1", "value": "Zarek: Did you think my story was over? The body may fall, but the knowledge... remains." },
    { "key": "level1_mentor1_line2", "value": "Zarek: You have reached a key point, where you will not only learn how blockchain works, but why it has withstood time and attacks. Many have tried to destroy it, no one has succeeded." },
    { "key": "level1_mentor1_line3", "value": "Zarek: Here you will discover the weaknesses they have tried to exploit, why they have failed to do so, and why every move on the network comes at a price." },
    { "key": "level1_mentor1_line4", "value": "Zarek: Listen carefully... This knowledge could be the only thing that saves you from digital collapse." },
    { "key": "level1_mentor1_line5", "value": "Zarek: One more thing... beware of golden drones, they are faster and can cause more damage. Remember you can upgrade your gun in the store." },
    { "key": "level1_mentor1_line6", "value": "Zarek: Good luck!" },
    { "key": "level1_mentor2_line1", "value": "Zarek: Even though Blockchain is very secure, it could be damaged if someone controlled more than half of the network. That’s called a 51% attack." },
    { "key": "level1_mentor2_line2", "value": "Zarek: But it’s super hard and expensive to do, especially in big blockchains with many users." },
    { "key": "level1_mentor3_line1", "value": "Zarek: Each block in the blockchain is like a safe that has a unique lock that depends on the previous safe." },
    { "key": "level1_mentor3_line2", "value": "Zarek: So if someone wants to change a block, he would have to open all the boxes from the beginning, one by one, which is almost impossible." },
    { "key": "level1_mentor3_line3", "value": "Zarek: That is why the blockchain is so secure and has never been hacked like other systems." },
    { "key": "level1_mentor4_line1", "value": "Zarek: In the blockchain world, there are people (or computers) who check that everything is okay before anything new is written." },
    { "key": "level1_mentor4_line2", "value": "Zarek: These people work hard and expend energy, so they are given a reward (a small amount of money or cryptocurrency)." },
    { "key": "level1_mentor4_line3", "value": "Zarek: That's what you pay with the transaction fee, to thank them for their help." },
    { "key": "level1_mentor5_line1", "value": "Zarek: Excellent, let's continue our journey." },

    { "key": "level2_mentor1_line1", "value": "Zarek: You should now understand how the blockchain gave way to a new form of money: cryptocurrencies." },
    { "key": "level2_mentor1_line2", "value": "Zarek: These are not just digital banknotes... they are currencies built on decentralized trust and cryptographic security." },
    { "key": "level2_mentor1_line3", "value": "Zarek: Get ready, this will bring you closer to mastering the code of this new world." },
    { "key": "level2_mentor1_line4", "value": "Zarek: Remember to answer all the three questions and to reach the alien when you finish to pass to the next level." },
    { "key": "level2_mentor1_line5", "value": "Zarek: Beware of the red drones, they are faster and do more damage." },
    { "key": "level2_mentor1_line6", "value": "Zarek: Good luck!" },

    { "key": "level2_mentor2_line1", "value": "Zarek: Cryptocurrency is digital money that does not depend on banks or governments." },
    { "key": "level2_mentor2_line2", "value": "Zarek: It is based on blockchain technology, which makes it secure and decentralized." },
    { "key": "level2_mentor2_line3", "value": "Zarek: It's like having your own bank, but on your phone." },

    { "key": "level2_mentor3_line1", "value": "Zarek: Although you can pay by card or from an app, this “digital money” is still controlled by banks. Cryptocurrencies are not." },
    { "key": "level2_mentor3_line2", "value": "Zarek: They are managed by thousands of computers around the world. No one can freeze or manipulate them." },

    { "key": "level2_mentor4_line1", "value": "Zarek: The best known are Bitcoin, Ethereum and Ripple. Each has its own functions." },
    { "key": "level2_mentor4_line2", "value": "Zarek: Each has its own functions." },
    { "key": "level2_mentor4_line3", "value": "Zarek: Ethereum allows you to create applications on its network. And Ripple seeks to facilitate international payments." },

    { "key": "level2_mentor5_line1", "value": "Zarek: Excellent! You almost finish this level." },

    { "key": "level3_mentor1_line1", "value": "Zarek: You're about to take control of your own digital money. But with great power, comes great responsibility." },
    { "key": "level3_mentor1_line2", "value": "Zarek: Here you will learn how to store your cryptocurrencies, how not to lose them... and how to buy them safely." },
    { "key": "level3_mentor1_line3", "value": "Zarek: Remember: in this world, forgetting your password is like losing a fortune." },
    
    { "key": "level3_mentor2_line1", "value": "Zarek: A cryptocurrency wallet is like a digital safe." },
    { "key": "level3_mentor2_line2", "value": "Zarek: It stores your private keys, which give you access to your coins." },
    { "key": "level3_mentor2_line3", "value": "Zarek: It can be an app on your phone, a physical device or even paper." },
    
    { "key": "level3_mentor3_line1", "value": "Zarek: Never share your private key!" },
    { "key": "level3_mentor3_line2", "value": "Zarek: Make a backup copy of your recovery phrases and store them in a safe place." },
    { "key": "level3_mentor3_line3", "value": "Zarek: If you lose your passwords, you lose access to your funds. There is no “I forgot my password” here." },
    
    { "key": "level3_mentor4_line1", "value": "Zarek: You can buy cryptocurrencies on exchanges (digital platforms) such as Binance or Coinbase." },
    { "key": "level3_mentor4_line2", "value": "Zarek: There you exchange traditional money for cryptocurrencies." },
    { "key": "level3_mentor4_line3", "value": "Zarek: You need an account, a wallet and sometimes identity verification." },

    
    { "key": "level4_mentor1_line1", "value": "Zarek: You thought cryptocurrencies were only for sending money... but you're just scratching the surface." },
    { "key": "level4_mentor1_line2", "value": "Zarek: Blockchain technology can do so much more. From gaming to contracts to voting systems." },
    { "key": "level4_mentor1_line3", "value": "Zarek: In this level you'll learn what mining is and what amazing things are already being built with this technology." },

    { "key": "level4_mentor2_line1", "value": "Zarek: Mining is the process in which the most powerful nodes solve complex mathematical problems to validate new transactions" },
    { "key": "level4_mentor2_line2", "value": "Zarek: As a reward, they receive cryptocurrencies. It is like a digital math competition." },

    { "key": "level4_mentor3_line1", "value": "Zarek: Blockchain is not just for money." },
    { "key": "level4_mentor3_line2", "value": "Zarek: It can be used to create games, smart contracts, digital identities, voting systems and even more transparent supply chains." },

    { "key": "level4_mentor4_line1", "value": "Zarek: Anyone can participate in a Blockchain network!" },
    { "key": "level4_mentor4_line2", "value": "Zarek: If you have a computer and internet access, you can be part of the network." },
    { "key": "level4_mentor4_line3", "value": "Zarek: You can be a node, a miner or just a user." },
    { "key": "level4_mentor4_line4", "value": "Zarek: The important thing is that everyone collaborates to keep the system running." },

    { "key": "level4_mentor5_line1", "value": "Zarek: Excellent! Your journey is almost finishing... we are getting closer to defeat Central Core." },

    { "key": "level5_mentor1_line1", "value": "Zarek: Answer all the questions and don't let OneCore catch you" },
    { "key": "level5_mentor1_line2", "value": "Zarek: You only have 10 seconds to answer each question." },
    { "key": "level5_mentor1_line3", "value": "Zarek: For each wrong answer you have, OneCore will increase its speed." },
    { "key": "level5_mentor1_line4", "value": "Zarek: You won't have access to the store." },
    { "key": "level5_mentor1_line5", "value": "Zarek: Good luck!" },
    { "key": "extra_life_acquired", "value": "Extra life acquired!" },
    { "key": "need_more_coins", "value": "Need more coins!" },
    { "key": "damage_max", "value": "Damage is at max." },
    { "key": "upgrade_requires_more_coins", "value": "Need more coins!" },
    { "key": "max_lives_reached", "value": "Max lives reached" },
    { "key": "new_damage", "value": "New damage: {0}" }

  ]
}